{
    "welcome": "Welcome to Our Website",
    "subtitle": " We aim to provide you with the best experience in your own language through our multilingual application.",
    "webTitle": "Web Development",
    "webDescription": " Web development refers to the process of building and maintaining websites. It involves tasks like designing the structure, implementing functionality, and ensuring user interaction on the web. Web development typically includes both frontend (client-side) and backend (server-side) development to create a fully functional site or web application.",
    "frontEnd":"Frontend Development",
    "frontEndDecription":"Frontend development focuses on creating the visual and interactive aspects of a website that users directly engage with. This includes designing the layout, structure, and functionality of the user interface using languages like HTML, CSS, and JavaScript, ensuring a seamless user experience across devices and browsers.",
    "angular": "Angular Developer",
    "angularDescription":"An Angular developer is a software developer specializing in using Angular, a popular open-source framework for building dynamic, single-page web applications. They are skilled in TypeScript, HTML, CSS, and JavaScript, and focus on creating the frontend of web applications with features like data binding, routing, and dependency injection.",
    "benefitTitle":"Benefits of Angular",
    "benefit1":"Two-Way Data Binding",
    "benefit1Des":"Angular’s two-way data binding simplifies synchronization between the model and the view, reducing the need for additional code.",
    "benefit2":"Modular Structure",
    "benefit2Des":"Angular’s modular approach promotes code reusability and maintainability, making it easier to scale large applications.",
    "benefit3":"Comprehensive Ecosystem",
    "benefit3Des":"Angular comes with built-in tools for routing, forms, HTTP requests, and testing, reducing the need for third-party libraries.",
    "benefit4":"Strong Community Support",
    "benefit4Des":"Angular is backed by a large, active community, providing ample resources, tutorials, and support for developers.",
    "agnularFeature":"Angular 19 Features",
    "agnularFeatureDes":"Angular 19 introduces several new features, including improved performance, better support for TypeScript 4.9, and enhanced accessibility tools. It also introduces advanced optimization techniques, making applications faster and more efficient, along with further updates to Angular’s CLI and better integration with modern build tools like Webpack."
}