{
    "welcome": "ہمارے ویب سائٹ پر خوش آمدید",
    "subtitle": "ہم اپنے کثیر لسانی ایپلیکیشن کے ذریعے آپ کو آپ کی اپنی زبان میں بہترین تجربہ فراہم کرنے کا مقصد رکھتے ہیں۔",
    "webTitle": "ویب ڈویلپمنٹ",
    "webDescription": "ویب ڈویلپمنٹ ویب سائٹس بنانے اور ان کی دیکھ بھال کرنے کے عمل کو کہتے ہیں۔ اس میں ساخت ڈیزائن کرنا، فعالیت کو نافذ کرنا اور ویب پر صارف کے تعامل کو یقینی بنانا شامل ہوتا ہے۔ ویب ڈویلپمنٹ میں عام طور پر فرنٹ اینڈ (کلائنٹ سائیڈ) اور بیک اینڈ (سرور سائیڈ) ڈویلپمنٹ دونوں شامل ہوتے ہیں تاکہ ایک مکمل کام کرنے والی ویب سائٹ یا ویب ایپلیکیشن بنائی جا سکے۔",
    "frontEnd": "فرنٹ اینڈ ڈویلپمنٹ",
    "frontEndDecription": "فرنٹ اینڈ ڈویلپمنٹ ویب سائٹ کے بصری اور تعاملاتی پہلوؤں کو بنانے پر مرکوز ہے جس سے صارف براہ راست مشغول ہوتے ہیں۔ اس میں یوزر انٹرفیس کے لے آؤٹ، ڈھانچے، اور فعالیت کو ڈیزائن کرنا شامل ہے، جیسے کہ HTML، CSS، اور JavaScript کا استعمال کرتے ہوئے، تاکہ مختلف آلات اور براؤزرز پر ایک ہموار صارف تجربہ کو یقینی بنایا جا سکے۔",
    "angular": "اینگولر ڈویلپر",
    "angularDescription": "اینگولر ڈویلپر ایک سافٹ ویئر ڈویلپر ہوتا ہے جو اینگولر کا استعمال کرنے میں مہارت رکھتا ہے، جو کہ ایک مشہور اوپن سورس فریم ورک ہے جو متحرک، سنگل پیج ویب ایپلیکیشنز بنانے کے لیے استعمال ہوتا ہے۔ یہ ٹائپ اسکرپٹ، HTML، CSS، اور JavaScript میں ماہر ہوتے ہیں، اور ویب ایپلیکیشنز کے فرنٹ اینڈ کو تخلیق کرنے پر مرکوز ہوتے ہیں جس میں ڈیٹا بائنڈنگ، راؤٹنگ، اور ڈپینڈنسی انجیکشن جیسی خصوصیات ہوتی ہیں۔",
    "benefitTitle": "اینگولر کے فوائد",
    "benefit1": "دو طرفہ ڈیٹا بائنڈنگ",
    "benefit1Des": "اینگولر کی دو طرفہ ڈیٹا بائنڈنگ ماڈل اور ویو کے درمیان ہم آہنگی کو سادہ بناتی ہے، اضافی کوڈ کی ضرورت کو کم کرتی ہے۔",
    "benefit2": "ماڈیولر ڈھانچہ",
    "benefit2Des": "اینگولر کا ماڈیولر طریقہ کار کوڈ کی دوبارہ استعمال کی سہولت دیتا ہے اور اس کی دیکھ بھال کو آسان بناتا ہے، جس سے بڑے ایپلیکیشنز کو اسکیل کرنا آسان ہوتا ہے۔",
    "benefit3": "مکمل ماحولیاتی نظام",
    "benefit3Des": "اینگولر میں راؤٹنگ، فارم، HTTP درخواستیں، اور ٹیسٹنگ کے لیے بلٹ ان ٹولز ہوتے ہیں، جو تھرڈ پارٹی لائبریریوں کی ضرورت کو کم کرتے ہیں۔",
    "benefit4": "مضبوط کمیونٹی سپورٹ",
    "benefit4Des": "اینگولر کو ایک بڑی، فعال کمیونٹی کی حمایت حاصل ہے، جو ڈویلپرز کے لیے بھرپور وسائل، ٹیوٹوریلز، اور سپورٹ فراہم کرتی ہے۔",
    "agnularFeature": "اینگولر 19 کی خصوصیات",
    "agnularFeatureDes": "اینگولر 19 کئی نئی خصوصیات متعارف کراتا ہے، جن میں کارکردگی میں بہتری، ٹائپ اسکرپٹ 4.9 کے لیے بہتر معاونت، اور رسائی کے ٹولز میں اضافہ شامل ہے۔ اس کے علاوہ، یہ جدید آپٹیمائزیشن تکنیکوں کو متعارف کراتا ہے، جس سے ایپلیکیشنز تیز اور زیادہ مؤثر بن جاتی ہیں، ساتھ ہی اینگولر کی CLI میں مزید اپ ڈیٹس اور جدید بلڈ ٹولز جیسے Webpack کے ساتھ بہتر انضمام شامل ہے۔"
}
